module.exports = {
    "status": 1,
    "count": 0,
    "message": "获取楼盘动态信息成功",
    "data": [
        {
            "id": 59,
            "title": "悟空优惠，付 1000 抵 5000 税费",
            "details": "每付 1000 可抵 5000 税费，更可现场获得返现机会每付 1000 可抵 5000 税费，更可现场获得返现机会。",
            "endTime": 1472115056000,
            "endTimeStr" : "2017-5-9"
        },
        {
            "id": 60,
            "title": "悟空优惠，付 1000 抵 5000 税费",
            "details": "每付 1000 可抵 5000 税费，更可现场获得返现机会每付 1000 可抵 5000 税费，更可现场获得返现机会。",
            "endTime": 1472115056000,
            "endTimeStr" : "2017-5-9"
        },
        {
            "id": 59,
            "title": "悟空优惠，付 1000 抵 5000 税费",
            "details": "每付 1000 可抵 5000 税费，更可现场获得返现机会每付 1000 可抵 5000 税费，更可现场获得返现机会。",
            "endTime": 1472115056000,
            "endTimeStr" : "2017-5-9"
        },
        {
            "id": 59,
            "title": "悟空优惠，付 1000 抵 5000 税费",
            "details": "每付 1000 可抵 5000 税费，更可现场获得返现机会每付 1000 可抵 5000 税费，更可现场获得返现机会。",
            "endTime": 1472115056000,
            "endTimeStr" : "2017-5-9"
        }
    ]
} ;