/*++----------------------------------------------------------------------------------------------------------------------------------------------------------------------
1. 项目名称：悟空找房+微信小程序
2. 文件名：pages -> agent -> detail.js
3. 作者：zhaohuagang@lifang.com
4. 备注：经纪人详情页面脚本逻辑
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------++*/
import request from "../../utils/request" ;
import $ from "../../utils/extend" ;
import detailFoot from "../components/detailfoot" ;
let bigData = require('../../utils/bigData');
var app = getApp() ;
const apiUrl = require('../../utils/apiUrl');
/*++----------------------------------------------------------------------------------------------------------------------------------------------------------------------
用来标识页面当前是否正在下拉加载数据
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------++*/
let esfIsLoading = false ; 
let xfIsLoading = false ; 
/*++----------------------------------------------------------------------------------------------------------------------------------------------------------------------
定义上拉加载新房请求数据对象格式，并赋予初始值
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------++*/
let pullLoadXfRequestData =  { "agentId" : null , "pageIndex" : 0 , "pageSize" : 10 } ; 
let pullLoadEsfRequestData =  { "agentId" : null , "pageIndex" : 0 , "pageSize" : 10 } ; 
/*++----------------------------------------------------------------------------------------------------------------------------------------------------------------------
定义页面初始化参数
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------++*/
let params = $.extend(true , {} , detailFoot , {
    data : {
        "pageParams" : {} ,  //页面参数对象
        "esfIsNoData" : false ,  //用来标识页面二手房数据是否加载完毕
        "esfLoadError" : false ,  //是否存在二手房数据加载错误
        "xfIsNoData" : false ,  //用来标识页面新房数据是否加载完毕
        "xfLoadError" : false ,  //是否存在新房数据加载错误
        "currentSourcesTab" : "esf"  //默认设置推荐房源停留在新房这个tab，等待切换
    } ,
    /*++----------------------------------------------------------------------------------------------------------------------------------------------------------------------
    渲染页面方法
    -----------------------------------------------------------------------------------------------------------------------------------------------------------------------++*/
    render : function() {
        let _ = this ;       
        request.fetch({
            "module": "agent",
            "action": "detail",            
            "data": { "agentId" :  _.data.pageParams.agentId } ,
            "showLoading": true ,
            "mock" : false ,
            success: function(res) {
                let result = res.data ;
                //经纪人公司名称取得规则：有简称显示简称，无简称显示全称，全称也没有就不显示
                let abbreviation = result.simpleAgentDetail.abbreviation ;
                let companyName = result.simpleAgentDetail.companyName ;
                let finalCompanyName = abbreviation ? abbreviation : ( companyName ? companyName : "") ;
                result.simpleAgentDetail.finalCompanyName = finalCompanyName ;
                result.shareTitle = finalCompanyName + "经纪人" + result.simpleAgentDetail.agentName ;
                if(result.simpleAgentDetail.vipType === 5) result.shareTitle = "小区专家" + result.simpleAgentDetail.agentName ;                
                //给二手房和新房两个组件赋值，并将agentId带进去
                result.xfSources = _.mapSource(result.recommendNewHouseList) ;                 
                result.esfSources = _.mapSource(result.recommendOldHouseList) ; 
                //判断熟悉商圈后面是否需要出...更多
                let agentBizTownList = result.simpleAgentDetail.agentBizTownList || [] ;
                agentBizTownList = agentBizTownList.join(",") ;
                result.agentBizTownListExtendable = agentBizTownList && agentBizTownList.length > 16 ? true : false ;
                result.simpleAgentDetail.shortAgentBizTownList = agentBizTownList.substr(0, 16) + "..." ;  
                //判断自我介绍后面是否需要出...更多
                let agentIntroduction = result.simpleAgentDetail.agentIntroduction || "" ;
                result.agentIntroductionExtendable = agentIntroduction && agentIntroduction.length > 32 ? true : false ;
                result.simpleAgentDetail.shortAgentIntroduction = agentIntroduction.substr(0, 32) + "..." ; 
                //判断成交故事后面是否需要出...更多
                let agentStory = result.simpleAgentDetail.agentStory || "" ;
                result.agentStoryExtendable = agentStory && agentStory.length > 32 ? true : false ;
                result.simpleAgentDetail.shortAgentStory = agentStory.substr(0, 32) + "..." ; 
                /*++----------------------------------------------------------------------------------------------------------------------------------------------------------------------
                 设置导航栏标题，格式为："公司名称 经纪人名称"
                 -----------------------------------------------------------------------------------------------------------------------------------------------------------------------++*/
                 wx.setNavigationBarTitle({
                     title : result.simpleAgentDetail.agentName
                 }) ;              
                //最后赋予模板变量
                result.agentInfo = result.simpleAgentDetail ;
                if(result.agentInfo){
                  result.agentInfo.imgEventName = 1002021;
                  result.agentInfo.phoneEventName = 1002001;
                  result.agentInfo.wechatEventName = 1002007;
                  result.agentInfo.agentId = _.data.pageParams.agentId;                  

                }
                _.setData(result) ;
                
            }
        }) ;
    } ,
    /*++----------------------------------------------------------------------------------------------------------------------------------------------------------------------
    切换二手房新房tab的方法
    -----------------------------------------------------------------------------------------------------------------------------------------------------------------------++*/
    swapToTab : function(event) {
        this.setData({ "currentSourcesTab": event.currentTarget.dataset.tab }) ;
    } ,
    /*++----------------------------------------------------------------------------------------------------------------------------------------------------------------------
    点击"我来评价"先判断是否登录来决定跳转到哪个页面
    -----------------------------------------------------------------------------------------------------------------------------------------------------------------------++*/    
    gotoRate : function(event){
        this.bigData(event);

        let url = event.currentTarget.dataset.url;
        if(app.isLogin(true, url)){
          wx.redirectTo({
            url: url
          });
        }        
    } ,
    /*++----------------------------------------------------------------------------------------------------------------------------------------------------------------------
    展开熟悉商圈的方法
    -----------------------------------------------------------------------------------------------------------------------------------------------------------------------++*/
    extendAgentBizTownList : function() {
        this.setData({ "agentBizTownListExtendable": false }) ;
    } ,
    /*++----------------------------------------------------------------------------------------------------------------------------------------------------------------------
    点经纪人电话，拨打电话
    -----------------------------------------------------------------------------------------------------------------------------------------------------------------------++*/
    callAgent: function(event) {
        this.bigData(event);
        wx.makePhoneCall({
            phoneNumber: event.target.dataset.phone
        })
    },
    /*++----------------------------------------------------------------------------------------------------------------------------------------------------------------------
    保存经纪人小程序二维码
    -----------------------------------------------------------------------------------------------------------------------------------------------------------------------++*/
    saveAgentQRCode: function(event) {
        this.bigData(event);
        wx.showModal({
            "title": "提示",
            "content": "需要保存到相册吗？",
            "success": function(res) {
                wx.getSetting({
                    success(res) {
                        if (!res['scope.writePhotosAlbum']) {
                            wx.authorize({
                                scope: 'scope.writePhotosAlbum',
                                success() {
                                    wx.downloadFile({
                                        url:event.target.dataset.src,
                                        success: function(res) {
                                            wx.saveImageToPhotosAlbum({
                                                filePath: res.tempFilePath,
                                                success(res) {
                                                    app.showTips('已保存到手机相册!')
                                                },
                                                fail(res) {
                                                    app.showTips('保存到相册失败!')
                                                }
                                            })
                                        },
                                        fail: function() {
                                           app.showTips('保存到相册失败!')
                                        }
                                    })
                                },
                                fail(res) {
                                    app.showTips('保存到相册失败!')
                                }
                            })
                        }
                    }
                })
            }
        })
    },
    /*++----------------------------------------------------------------------------------------------------------------------------------------------------------------------
    展开自我介绍的方法
    -----------------------------------------------------------------------------------------------------------------------------------------------------------------------++*/
    extendAgentIntroduction : function() {
        this.setData({ "agentIntroductionExtendable": false }) ;
    } ,
    /*++----------------------------------------------------------------------------------------------------------------------------------------------------------------------
    展开成交故事的方法
    -----------------------------------------------------------------------------------------------------------------------------------------------------------------------++*/
    extendAgentStory : function() {
        this.setData({ "agentStoryExtendable": false }) ;
    } ,
    /*++----------------------------------------------------------------------------------------------------------------------------------------------------------------------
    二手房源下拉加载方法
    -----------------------------------------------------------------------------------------------------------------------------------------------------------------------++*/
    loadMoreEsf : function() {
        let _ = this ;
        /*++----------------------------------------------------------------------------------------------------------------------------------------------------------------------
        如果正在加载数据就直接返回
        如果已经没有了数据，先将pageIndex=0后返回
        -----------------------------------------------------------------------------------------------------------------------------------------------------------------------++*/
        if(esfIsLoading) return ; 
        if(this.data.esfIsNoData) {
            pullLoadEsfRequestData.pageIndex = 0 ;
            return ;
        }
        /*++----------------------------------------------------------------------------------------------------------------------------------------------------------------------
        如果页面本身房源就少于10 条，那都不需要加载了，枝江显示无数据了返回
        -----------------------------------------------------------------------------------------------------------------------------------------------------------------------++*/
        if(this.data.esfSources.length < 10) {
            _.setData({ "esfIsNoData" : true }) ;
            return ;
        }
        /*++----------------------------------------------------------------------------------------------------------------------------------------------------------------------
        开始加载
        -----------------------------------------------------------------------------------------------------------------------------------------------------------------------++*/
        esfIsLoading = true ; 
        /*++----------------------------------------------------------------------------------------------------------------------------------------------------------------------
        准备请求参数
        -----------------------------------------------------------------------------------------------------------------------------------------------------------------------++*/
        pullLoadEsfRequestData.agentId = this.data.pageParams.agentId ;
        pullLoadEsfRequestData.pageIndex += 10 ;
        /*++----------------------------------------------------------------------------------------------------------------------------------------------------------------------
        获取数据并渲染和处理
        -----------------------------------------------------------------------------------------------------------------------------------------------------------------------++*/
        request.fetch({
            "module" : "agent",
            "action" : "getMoreEsf",            
            "data" : pullLoadEsfRequestData ,   
            "showLoading": true ,         
            "mock" : false ,
            success : function(res) {
                _.setData({ "esfLoadError" : false }) ;
                let result = _.data.esfSources ;
                if(res.data && res.data.length) {                    
                     _.setData({ "esfSources" : result.concat(_.mapSource(res.data)) }) ;     
                } else _.setData({ "esfIsNoData": true });
            } ,
            fail : function(res) {
                _.setData({ "esfLoadError" : true }) ;    
            } ,
            complete : function() {
                esfIsLoading = false ;
            }
        }) ;
    } ,
    /*++----------------------------------------------------------------------------------------------------------------------------------------------------------------------
    新房房源下拉加载方法
    -----------------------------------------------------------------------------------------------------------------------------------------------------------------------++*/
    loadMoreXf : function() {
        let _ = this ;
        /*++----------------------------------------------------------------------------------------------------------------------------------------------------------------------
        如果正在加载数据就直接返回
        如果已经没有了数据，先将偏移值置为0 再返回
        -----------------------------------------------------------------------------------------------------------------------------------------------------------------------++*/
        if(xfIsLoading) return ; 
        if(this.data.xfIsNoData) {
            pullLoadXfRequestData.pageIndex = 0 ;
            return ;
        }
        /*++----------------------------------------------------------------------------------------------------------------------------------------------------------------------
        如果页面本身房源就少于10 条，那都不需要加载了，枝江显示无数据了返回
        -----------------------------------------------------------------------------------------------------------------------------------------------------------------------++*/
        if(this.data.xfSources.length < 10) {
            _.setData({ "xfIsNoData" : true }) ;
            return ;
        }
        /*++----------------------------------------------------------------------------------------------------------------------------------------------------------------------
        开始加载
        -----------------------------------------------------------------------------------------------------------------------------------------------------------------------++*/
        xfIsLoading = true ;
        /*++----------------------------------------------------------------------------------------------------------------------------------------------------------------------
        准备请求参数
        -----------------------------------------------------------------------------------------------------------------------------------------------------------------------++*/
        pullLoadXfRequestData.agentId = this.data.pageParams.agentId ;
        pullLoadXfRequestData.pageIndex += 10 ;
        /*++----------------------------------------------------------------------------------------------------------------------------------------------------------------------
        获取数据并渲染和处理
        -----------------------------------------------------------------------------------------------------------------------------------------------------------------------++*/
        request.fetch({
            "module" : "agent",
            "action" : "getMoreXf",            
            "data" : pullLoadXfRequestData ,
            "showLoading": true ,
            "mock" : false ,
            success : function(res) {
                _.setData({ "xfLoadError" : false }) ;
                let result = _.data.xfSources ;
                if(res.data && res.data.length) {
                    result = result.concat(_.mapSource(res.data)) ;  
                     _.setData({ "xfSources" : result }) ;     
                } else _.setData({ "xfIsNoData": true });
                console.log(_.data.xfSources.length) ;               
            } ,
            fail : function(res) {
                _.setData({ "xfLoadError" : true }) ;    
            } ,
            complete : function() {
                xfIsLoading = false ;
            }
        }) ;
    }  ,
    /*++----------------------------------------------------------------------------------------------------------------------------------------------------------------------
    页面拉到底部的时候的处理
    -----------------------------------------------------------------------------------------------------------------------------------------------------------------------++*/
    onReachBottom : function() {       
        if(this.data.recommendType === 0) return ;
        if(this.data.recommendType === 2) this.loadMoreEsf() ;
        else if(this.data.recommendType === 1) this.loadMoreXf() ;
        else {
            if(this.data.currentSourcesTab === "esf") this.loadMoreEsf() ;
            else this.loadMoreXf() ;
        }
    } ,
    /*++----------------------------------------------------------------------------------------------------------------------------------------------------------------------
    对于房源数据的处理：
    1. 把agentId加到房源数据中去的方法
    2. 新房价格为0时显示为待定
    -----------------------------------------------------------------------------------------------------------------------------------------------------------------------++*/
    mapSource : function(sources) {
        if(!sources) return sources ;
        let _ = this ;        
        sources.forEach(function(element){
            element.agentId = _.data.pageParams.agentId ;
            if ( element.avgPriceWou !== undefined ) {
                let originalPrice = element.avgPriceWou ;
                element.avgPriceWou = ( ! originalPrice || parseInt( originalPrice , 10 ) === 0 ) ? "价格待定" : originalPrice + "元/㎡" ;
            }            
        }) ;
        return sources ;
    } ,
    /*++----------------------------------------------------------------------------------------------------------------------------------------------------------------------
    页面加载完触发
    -----------------------------------------------------------------------------------------------------------------------------------------------------------------------++*/
    onLoad : function(options) {        
        var _this = this;
        //把页面参数保存到页面数据中
        this.setData({ "pageParams" : options }) ;        
        //获取当前页面的小程序二维码
        app.getwxacode(function(res) {
            let url = apiUrl.get("common", "getQR")
            _this.setData({
                "QRUrl": url + "?token=" + res.data + "&scene=agentId_" + options.agentId + "&width=120"
            })
        })
    } ,

    /*++----------------------------------------------------------------------------------------------------------------------------------------------------------------------
    页面显示完触发
    -----------------------------------------------------------------------------------------------------------------------------------------------------------------------++*/
    onShow : function() {
        //渲染页面
        this.render() ;
    } ,
    /*++----------------------------------------------------------------------------------------------------------------------------------------------------------------------
    转发标题设置
    -----------------------------------------------------------------------------------------------------------------------------------------------------------------------++*/
    onShareAppMessage : function() {
        return {
            "title" : this.data.shareTitle
        }
    },
    /*++----------------------------------------------------------------------------------------------------------------------------------------------------------------------
    埋点    -----------------------------------------------------------------------------------------------------------------------------------------------------------------------++*/
    bigData: function (e) {
      bigData.send(e.currentTarget.dataset);
    }
}) ;
/*++----------------------------------------------------------------------------------------------------------------------------------------------------------------------
实例化页面
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------++*/
Page(params);
